src/cf/InformationRegisters/ObjectsDataToRegisterInExchanges.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ObjectsDataToRegisterInExchanges</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Ref</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>InfobaseNode</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ObjectsDataToRegisterInExchanges/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// 
//  
// 
// 
// 
///////////////////////////////////////////////////////////////////////////////////////////////////////

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Internal

Function ObjectIsInRegister(Object, InfobaseNode) Export
	
	QueryText = "
	|SELECT 1
	|FROM
	|	InformationRegister.ObjectsDataToRegisterInExchanges AS ObjectsDataToRegisterInExchanges
	|WHERE
	|	  ObjectsDataToRegisterInExchanges.InfobaseNode           = &InfobaseNode
	|	AND ObjectsDataToRegisterInExchanges.Ref = &Object
	|";
	
	Query = New Query;
	Query.SetParameter("InfobaseNode", InfobaseNode);
	Query.SetParameter("Object", Object);
	Query.Text = QueryText;
	
	Return Not Query.Execute().IsEmpty();
EndFunction

Procedure AddObjectToAllowedObjectsFilter(Val Object, Val Recipient) Export
	
	If Not ObjectIsInRegister(Object, Recipient) Then
		
		RecordStructure = New Structure;
		RecordStructure.Insert("InfobaseNode", Recipient);
		RecordStructure.Insert("Ref", Object);
		
		AddRecord(RecordStructure, True);
	EndIf;
	
EndProcedure

Procedure DeleteInformationAboutUploadingObjects(ExportedByRefObjects, InfobaseNode) Export
	
	RecordStructure = New Structure("Ref, InfobaseNode");
	If TypeOf(ExportedByRefObjects) = Type("Array") Then
		
		For Each ArrayElement In ExportedByRefObjects Do
			
			RecordStructure.Ref = ArrayElement;
			RecordStructure.InfobaseNode = InfobaseNode;
			DeleteRecord(RecordStructure, True);
			
			
		EndDo;
		
	Else
		
		RecordStructure.Ref = ExportedByRefObjects;
		RecordStructure.InfobaseNode = InfobaseNode;
		DeleteRecord(RecordStructure, True);
		
	EndIf;
	
EndProcedure

#EndRegion

#Region Private

// The procedure adds an entry to the register based on the passed structure values.
Procedure AddRecord(RecordStructure, Load = False)
	
	DataExchangeInternal.AddRecordToInformationRegister(RecordStructure, "ObjectsDataToRegisterInExchanges", Load);
	
EndProcedure

Procedure DeleteRecord(RecordStructure, Load = False)
	
	BeginTransaction();
	Try
		
		Block = New DataLock;
		LockItem = Block.Add("InformationRegister.ObjectsDataToRegisterInExchanges");
		LockItem.SetValue("Ref", RecordStructure.Ref);
		LockItem.SetValue("InfobaseNode", RecordStructure.InfobaseNode);
		Block.Lock();
		
		// 
		RecordSet = InformationRegisters.ObjectsDataToRegisterInExchanges.CreateRecordSet();
		RecordSet.Filter.Ref.Set(RecordStructure.Ref, True);
		RecordSet.Filter.InfobaseNode.Set(RecordStructure.InfobaseNode, True);
		RecordSet.DataExchange.Load = Load;
		RecordSet.Write(True);
		
		CommitTransaction();
		
	Except
		
		RollbackTransaction();
		Raise;
		
	EndTry;
	
EndProcedure

#EndRegion

#EndIf
